---
kind: method
id: M:Autodesk.Revit.DB.Floor.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop},Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
zh: 创建、新建、生成、建立、新增
source: html/a9c74a9f-46eb-a1b7-608e-2039f06be579.htm
---
# Autodesk.Revit.DB.Floor.Create Method

**中文**: 创建、新建、生成、建立、新增

Creates a new instance of architectural floor within the project.

## Syntax (C#)
```csharp
public static Floor Create(
	Document document,
	IList<CurveLoop> profile,
	ElementId floorTypeId,
	ElementId levelId
)
```

## Parameters
- **document** (`Autodesk.Revit.DB.Document`) - The document in which the new floor is created.
- **profile** (`System.Collections.Generic.IList < CurveLoop >`) - An array of planar curve loops that represent the profile of the floor.
- **floorTypeId** (`Autodesk.Revit.DB.ElementId`) - Id of the floor type to be used by the new Floor.
- **levelId** (`Autodesk.Revit.DB.ElementId`) - Id of the level on which the floor is to be placed.

## Returns
If successful a new floor object within the project.

## Remarks
To validate curve loop profile use BoundaryValidation .
 To get default floor type use GetDefaultFloorType(Document, Boolean) .

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - The ElementId levelId is not a Level.
 -or-
 The floorTypeId does not correspond to a FloorType.
 -or-
 The input curve loops cannot compose a valid boundary, that means:
 the "curveLoops" collection is empty;
 or some curve loops intersect with each other;
 or each curve loop is not closed individually;
 or each curve loop is not planar;
 or each curve loop is not in a plane parallel to the horizontal(XY) plane;
 or input curves contain at least one helical curve.
 -or-
 Input curves build invalid sketch.
 -or-
 Failed to create curve elements.
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Cannot generate a sketch.
 -or-
 Failed to create new element.
- **Autodesk.Revit.Exceptions.ModificationForbiddenException** - The document is in failure mode: an operation has failed,
 and Revit requires the user to either cancel the operation
 or fix the problem (usually by deleting certain elements).
 -or-
 The document is being loaded, or is in the midst of another
 sensitive process.
- **Autodesk.Revit.Exceptions.ModificationOutsideTransactionException** - The document has no open transaction.